Repository: teleofis/teleofis-feed
Catalog: luci/luci-app-pptpd/po/*/pptpd.po
Languages: ru

source: PPTP Server
ru: PPTP-сервер

source: Simple, quick and convenient PPTP VPN, universal across the platform
ru: Простой, быстрый, удобный и мультиплатформенный PPTP VPN

source: Users Manager
ru: Управление пользователями

source: Online Users
ru: Подключенные пользователи

source: Enable PPTP Server
ru: Включить PPTP-сервер

source: Local IP
ru: Локальный IP-адрес сервера

source: Remote IP Range Start
ru: Начало диапазона IP-адресов клиентов

source: Remote IP Range End
ru: Конец диапазона IP-адресов клиентов

source: Add route
ru: Добавить маршрут

source: Server IP
ru: IP-адрес сервера

source: Client IP
ru: IP-адрес клиента
