Repository: teleofis/teleofis-feed
Catalog: luci/luci-app-zabbix/po/*/zabbix.po
Languages: ru

source: Zabbix Agent configuration
ru: Настройки Zabbix Agent

source: General Settings
ru: Основные настройки

source: Passive Checks
ru: Пассивные проверки

source: Active Checks
ru: Активные проверки

source: TLS Configuration
ru: TLS шифрование

source: Enabled
ru: Включить

source: Unique hostname used by the agent to register with the Zabbix server. Required for active checks and must match the node name specified on the server.
ru: Уникальное имя хоста, используемое агентом для регистрации на сервере Zabbix. Необходимо для активных проверок и должно соответствовать имени узла, указанному на сервере.

source: List of IP addresses (or hostnames) of Zabbix servers allowed to connect to this agent. If 0.0.0.0/0 is specified, the agent will accept connections from any IP address.
ru: Список IP-адресов (или имён хостов) серверов Zabbix, которым разрешено подключаться к этому агенту. Если указать 0.0.0.0/0, агент будет принимать подключения с любого IP-адреса.

source: IP address of the local network interfaces on which the Zabbix agent will listen for incoming connections from the server.
ru: IP-адрес локальных сетевых интерфейсов, на которых Zabbix-агент будет ожидать входящие соединения от сервера.

source: The agent will listen on this port for connections from the server.
ru: Агент будет слушать этот порт для подключений с сервера.

source: The parameter defines which types of TLS connections the agent will accept.
ru: Параметр определяет, какие типы TLS-соединений агент будет принимать.

source: without encryption
ru: без шифрования

source: pre-shared key
ru: pre-shared ключ

source: certificate
ru: сертификат

source: IP address or hostname of the Zabbix server for active checks. If the parameter is not specified, active checks are disabled.
ru: IP адрес или имя хоста Zabbix-сервера для активных проверок. Если параметр не указан, активные проверки отключены.

source: The parameter defines how the agent should establish a secure connection with the Zabbix server or proxy.
ru: Параметр определяет, как агент должен устанавливать защищенное соединение с Zabbix-сервером или прокси.

source: Pre-shared key identifier string. Used for unique identification and management of the pre-shared key, ensuring the security of the connection between the agent and the server.
ru: Строка идентификатор pre-shared ключа. Используется для уникальной идентификации и управления предустановленным ключом, обеспечивая безопасность соединения между агентом и сервером.

source: Agent pre-shared key.
ru: Pre-shared ключ агента.

source: Root CA certificate. Used for encrypted connections between Zabbix components.
ru: Сертификат верхнего уровня CA. Используется для зашифрованных соединений между Zabbix компонентами.

source: Agent certificate or certificate chain used to establish secure (TLS/SSL) connections between Zabbix components.
ru: Сертификат агента или цепочка сертификатов, используемых для установления защищенных (TLS/SSL) соединений между компонентами Zabbix.

source: Agent private key.
ru: Приватный ключ агента.
