Repository: teleofis/teleofis-feed
Catalog: luci/luci-app-hotplug/po/*/hotplug.po
Languages: ru

source: Hotplug Rules
ru: Автоматизация (Hotplug)

source: Interface Rules
ru: Правила для интерфейсов

source: Description
ru: Описание

source: Activate
ru: Активировать

source: Variable $ACTION
ru: Переменная $ACTION

source: The type of event that will trigger the command
ru: Тип события, при котором будет выполнена команда

source: Variable $INTERFACE
ru: Переменная $INTERFACE

source: The name of the logical interface to which the command will be applied
ru: Имя логического интерфейса, к которому будет применимо правило

source: Command to execute
ru: Команда для выполнения

source: Running commands when the hotplug trigger occurs. <br/><br/>ACTION - ifdown, ifup, ifup-failed, ifupdate, free, reload, iflink, create <br/>INTERFACE - Name of the logical interface which went up or down (e.g. wan or lan) <br/>DEVICE - Name of the physical device which went up or down (e.g. eth0 or br-lan or pppoe-wan), when applicable <br/><br/>More information about iface events and variables here: <a href="https://openwrt.org/docs/guide-user/base-system/hotplug#iface">hotplug#iface</a>
ru: Выполнение команд при срабатывании триггера hotplug. <br/><br/>ACTION - ifdown, ifup, ifup-failed, ifupdate, free, reload, iflink, create <br/>INTERFACE - имя логического интерфейса, который был активирован или деактивирован (например, wan или lan) <br/>DEVICE - имя физического устройства, которое было активировано или деактивировано (например, eth0, br-lan или pppoe-wan), если применимо <br/><br/>Подробнее о событиях интерфейсов и переменных: <a href="https://openwrt.org/docs/guide-user/base-system/hotplug#iface">hotplug#iface</a>
